"CMHSecureConsentSectionTitle" = "Your Data is Secure";

"CMHSecureConsentSectionSummary" = "Data captured through your participation in this study will be stored on the CloudMine Connected Health Cloud, a secure, HIPAA-compliant data platform.";

"CMHSecureConsentSectionContent" = "CloudMine's Connected Health Cloud is a secure, HIPAA-compliant cloud platform used by leading healthcare, pharmaceutical, biotech, and medical devices to connect, analyze, and build engaging healthcare applications. Security is paramount to the Connected Health Cloud, including: constant monitoring, threat detection, end-to-end encryption, API key management, and more... In addition, CloudMine holds compliance certifications in HIPAA HITECH, ISO 27001 & HITRUST. Security & compliance are embedded at the core of CloudMine as a company, driving business processes and day-to-day operations. Rest assured that through certified compliance, and industry-leading security your personal data is safe. To learn more, visit: www.cloudmineinc.com.";


